       IDENTIFICATION DIVISION.
       PROGRAM-ID
           PHONE-SUPPORT.
       *DESCRIPTION.
       *Maintain a phone company's customer file. Allow for adding to
       *the file, searching for customers by name or phone number.
       *AUTHOR
       *       LEE HOLT.   APRIL 17, 2012.
       *       HIGHLY INFLUENCED BY PROFESSOR KEN HARTNESS.
       ENVIORNMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PHONE-DATA   ASSIGN TO "S\COBOL\PHONE\PHONEDATA.CBD".

           SELECT PHONE-HASH   ASSIGN TO "S\COBOL\PHONE\PHONETEMP.CBD"
                               ORGANIZATION IS RELATIVE
                               ACCESS IS RANDOM
                               RELATIVE KEY IS HI-POS.

           SELECT PHONE-FILE  ASSIGN TO "S\COBOL\PHONE\PHONEREC.CBD"
                               ORGANIZATION IS RELATIVE
                               ACCESS IS RANDOM
                               RELATIVE KEY IS BD-POS.


       DATA DIVISION.
       FILE SECTION.
       FD PHONE-DATA.
       01 PHONE-REC.
           05 CUS-NAME     PIC X(30).
           05 CUS-NUMB     PIC 9(10).
           05 CUS-ADD      PIC X(40).
           05 CUS-CITY     PIC X(30).
           05 CUS-STATE    PIC XX.
           05 CUS-ZIP      PIC 9(5).

       FD PHONE-HASH.
       01 HI-BUCKET        PIC 9(9) COMP.

       FD PHONE-FILE.
       01 H-PHONE-REC.
           05 PF-LENGTH    PIC 999 COMP.
           05 PF-DATA      OCCURS 1 TO 292 TIMES
                           DEPENDING ON PF-LENGTH
                           INDEXED BY X-BUCKET.
              10 PF-NUM    PIC 9(10).
              10 PF-LINK   PIC 9(9) COMP.


       WORKING-STORAGE DIVISION.
       01 W-NEEDS          PIC 9.
       01 W-HASH-POS       PIC 9(9) COMP.
       01 W-LENGTH         PIC 999.

       01 W-PHONE-NUMB     PIC 9(10).

       01 QUESTION1.
           05              PIC X(13) VALUE "SELECT 1, 2 OR 3".
           05              PIC X(18) VALUE "1 FOR SEARCHBYNAME".
           05              PIC X(21) VALUE "2 FOR SEARCHBYNUMBER".
           05              PIC X(14) VALUE "3 TO FINISH UP".

       01 W-PHONE-DATA.
           05 W-CUS-NAME   PIC X(30).
           05 W-CUS-NUM    PIC 9(10).
           05 W-CUS-ADD    PIC X(40).
           05 W-CUS-CITY   PIC X(40).
           05 W-CUS-STATE  PIC XX.
           05 W-CUS-ZIP    PIC 9(5).

       01 TEMPTOADD        PIC X(119).
       01 ADDNEWCUSTOMER   PIC XXX.

       PROCEDURE DIVISION.
       MAIN PARAGRAPH.
           OPEN    INPUT   PHONE-DATA
                   OUTPUT  PHONE-HASH
                   OUTPUT  PHONE-FILE.

       SET PF-LENGTH TO 0.
       PERFORM GET-READY.
       PERFORM WHATSUPDOC1 UNTIL W-NEEDS = 3.
       PERFORM WHATSUPDOC2.


       SUPPORTING-SUBROUTINES SECTION.

       WHATSUPDOC1.
           SET W-NEEDS TO 0.
           DISPLAY QUESTION1 WITHOUT ADVANCING.
           ACCEPT W-NEEDS.
           IF W-INFO = 1
               PERFORM SEARHBYNAME
           ELSE IF W-NEEDS = 2
               PERFORM SEARCHBYNUMBER
           ELSE DISPLAY "CHOOSE 1,2,OR 3" WITHOUT ADVANCING.
           ACCEPT W-NEEDS.

       SEARCHBYNAME.
       CALL "OPEN-CUSTOMER-NAME" USING HARKINDEX x(256).
       CALL "SEARCH-CUSTOMER-NAME" USING HARKINDEX position 9(9) comp ,
       						name x(30).
       	IF POSITION = 0
       	  DISPLAY "NAME NOT FOUND."
       	  CALL "ADD-CUSTOMER-NAME" USING STATUS(9), NAME X(30),
       	  				POSITION 9(9) COMP
       	  				CALL 'CLOSE-CUSTOMER-NAME'
       	  				
       	   ELSE DISPLAY "NAME FOUND"
       	  DISPLAY " W-CUSTOMERNAME(POSITION).
       CALL "NEXT-CUSTOMER-NAME" USING POSITION 9(9) COMP, NAME X(30).
       	  IF POSITION = 0
       	 DISPLAY "THATS ALL FOLKS"
       	  ELSE DISPLAY "NAME FOUND"
       	 DISPLAY  W-CUSTOMERNAME(POSITION).
	
	
       SEARCHBYNUMBER.
           DISPLAY "ENTER THE NUMBER TO BE SEARCHED" WITHOUT ADVANCING.
           ACCEPT W-PHONE-NUMB.
           IF W-PHONE-NUMB > 1000000000
               MOVE PF-LENGTH TO W-LENGTH.
               SET PF-LENGTH TO 0.
               PERFORM NUMBTABLE UNTIL PF-LENGTH > W-LENGTH
           ELSE DISPLAY "INVALID NUMBER GIVEN, TRY AGAIN."

           IF PF-LENGTH > W-LENGTH
               DISPLAY "Number not found, add new customer?"
               ACCEPT ADDNEWCUSTOMER.
                      IF ADDNEWCUSTOMER = "Y" OR "YES",
                         PERFORM ADDNEWCUSTOMERNOW
                      ELSE IF ADDNEWCUSTOMER = "N" OR "NO",
                         DISPLAY "RETRY THAT PHONE NUMBER THEN SIR".


       GET-READY.
           MOVE 128 TO HI-BUCKET.
           MOVE 1 TO W-HASH-POS.
           WRITE HI-BUCKET.
           MOVE 2 TO HI-BUCKET.
         PERFORM VARYING W-HASH-POS FROM 2 BY 1 UNTIL W-HASH-POS > 129.
               WRITE HI-BUCKET.
           END-PERFORM.
           MOVE 1 TO W-BUCKET.
           MOVE "Phone Hash Table Index" TO H-PHONE-REC.
           MOVE 2 TO PF-LINK(292).
           WRITE BUCKET-REC.
           MOVE 2 TO H-PHONE-REC.
           MOVE 0 TO PF-LENGTH.


       NUMTABLE.
           IF W-PHONE-NUMB = PF-DATA(PF-LENGTH)
                   DISPLAY "FOUND THE NUMBER"
                   DISPLAY PF-LENGTH
           ELSE ADD 1 TO PF-LENGTH.


       WHATSUPDOC2.
       CLOSE      PHONE-DATA
                  PHONE-REC
                  PHONE-FILE.
       STOP RUN.

       ADDNEWCUSTOMER.
            DISPLAY "ENTER CUSTOMERS FIRST AND LAST NAME"
            ACCEPT W-CUS-NAME.
            DISPLAY "ENTER CUSTOMERS NUMBER"
            ACCEPT W-CUS-NUMB.
            DISPLAY "ENTER CUSTOMERS ADDRESS".
            ACCEPT W-CUS-ADD.
            DISPLAY "ENTER CUSTOMERS CITY".
            ACCEPT W-CUS-CITY.
            DISPLAY "ENTER STATE INITIALS".
            ACCEPT W-CUS-STATE.
            DISPLAY "ENTER ZIP CODE".
            ACCEPT W-CUS-ZIP.

            ADD 1 TO PF-LENGTH.
            MOVE PF-LENGTH TO X-BUCKET.
            MOVE W-CUS-NUM TO PF-NUM(X-BUCKET).
            WRITE PF-DATA.
       CLOSE PHONE-DATA.
       OPEN OUTPUT PHONE-DATA.
           MOVE W-PHONE-DATA TO TEMPTOADD.
           WRITE PHONE-DATA FROM TEMPTOADD.
       CLOSE PHONE-DATA.
       OPEN INPUT PHONE-DATA.

















